/*
 * =====================================================================================
 *
 *       Filename:  Agent.cpp
 *
 *    Description:  
 *
 *         Author:  Noaki Ueda
 *   Organization:  OPU, 3G
 *
 * =====================================================================================
 */

#ifndef ___AGENT
#define ___AGENT

#include "Global.h"
#include "TagInterface.h"

/*
 * =====================================================================================
 *        Class:  Agent
 *  Description:  
 * =====================================================================================
 */
class Agent : public __TagInterface
{
    private:
        // int tag_[ TAG_LEN_A ];                  /* エージェントのタグ */
    public:
        Agent( int n ) : __TagInterface( n ) {};
        // int *getTag_();                         /* タグへのポインタを返す */

        // TODO
        bool hasImmunity();                     /* 免疫獲得しているかどうか */
        void response();                        /* 免疫応答する */
};

/*
 *--------------------------------------------------------------------------------------
 *      Method:  Agent :: Agent()
 * Description:  
 *--------------------------------------------------------------------------------------
 */
//Agent :: Agent()
//{
//    FOR(i, TAG_LEN_A)
//    {
//        tag_[i] = 0;                            /* 0で初期化 */
//    }
//}

/*
 *--------------------------------------------------------------------------------------
 *      Method:  Agent :: getTag_()
 * Description:  
 *--------------------------------------------------------------------------------------
 */
//int *Agent :: getTag_()
//{
//    return tag_;
//}

#endif
