/*
 * =====================================================================================
 *
 *       Filename:  Monitor.h
 *
 *    Description:  
 *
 *         Author:  Naoki Ueda
 *   Organization:  OPU, 3G
 *
 * =====================================================================================
 */

#ifndef ___MONITOR
#define ___MONITOR


/*
 * =====================================================================================
 *        Class:  Monitor
 *  Description:  シングルトンパターン
 * =====================================================================================
 */
class Monitor {
    private:
        Monitor() {}                            /* コンストラクタ */
    public:
        static Monitor& getInstance();

        void resetAll();                           /* 値をすべてリセット */
};

#endif
