/*
 * =====================================================================================
 *
 *       Filename:  TagInterface.cpp
 *
 *    Description:  タグを持つクラスのためのインターフェイス
 *                  エージェント、ウイルス用
 *
 *         Author:  
 *   Organization:  
 *
 * =====================================================================================
 */

typedef int tag_t

/*
 * =====================================================================================
 *        Class:  __TagInterface
 *  Description:  
 * =====================================================================================
 */
class __TagInterface
{
    private:
        tag_t *tag_;
    public:
        __TagInterface( int );                  /* コンストラクタ */
                                                /* タグの長さを初期化する */

        int *getTag_();                         /* タグ配列へのポインタを返す */
};

__TagInterface :: __TagInterface( int n )
{
    tag_ = new tag_t[ n ];                      /* タグを初期化 */
    FOR( i, n )
    {
        tag_[i];                                /* すべてを０で初期化 */
    }
}
